# UnexpectedCurveIntersectionFailure Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..UnexpectedCurveIntersectionFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Computing curve intersection and find the invalid result.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnexpectedCurveIntersectionFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnexpectedCurveIntersectionFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnexpectedCurveIntersectionFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace